export default class SearchData{
  constructor(){
    this.classification = {
     '육류':['소고기', '돼지고기', '양고기', '닭고기','오리고기','달걀','메추리알'],
     '해산물':['고등어','꽁치','날치','갈치','연어','송어','새우','게','오징어','문어','낙지','쭈꾸미','멍게'],
     '채소':['감자', '고구마', '곤약', '마', '마카', '토란','강낭콩', '녹두', '대두', '완두', '팥','땅콩', '도토리', '마카다미아', '밤', '아몬드', '은행', '잣', '피스타치오', '호두',
     '갓', '고추냉이', '냉이', '당귀', '돌나물', '머위', '무', '민들레', '비름나물', '비트', '뽕', '상추', '시금치', '신선초', '쑥', '아욱', '양상추', '우엉', '참나물', '청경채', '취나물', '치커리', '케일', '파슬리', '호박',
     '고추냉이', '당근', '더덕', '도라지', '마늘', '비트', '생강', '순무', '양파', '연근', '우엉', '치커리',
     '고구마', '고사리', '달래', '두릅', '미나리', '부추', '셀러리', '아스파라거스', '죽순', '콜라비', '토란', '파', '풋마늘',
     '멜론', '박', '수박', '오이', '참외', '호박','가지', '고추', '토마토', '피망'
    ],
     '과일':['감', '배', '사과', '석류','대추', '매실', '복숭아', '오미자', '자두', '체리','감귤', '레몬', '오렌지', '유자', '자몽'],
     '버섯':['새송이버섯','표고버섯','느타리버섯','목이버섯','양송이버섯','송이버섯','목이버섯'],
     '곡류' : ['귀리', '메밀', '밀', '보리', '수수', '쌀', ' 옥수수', '율무', '조', '퀴노아', '피', '호밀']
    }
    this.all_tag = ['소고기', '돼지고기', '양고기', '닭고기','오리고기','달걀','메추리알', '고등어','꽁치','날치',
    '갈치','연어','송어','새우','게','오징어','문어','낙지','쭈꾸미','멍게','감자', '고구마', '곤약', '마', '마카', '토란',
    '강낭콩', '녹두', '대두', '완두', '팥','땅콩', '도토리', '마카다미아', '밤', '아몬드', '은행', '잣', '피스타치오', '호두',
    '배추', '브로콜리', '양배추','갓', '고추냉이', '냉이', '당귀', '돌나물', '머위', '무', '민들레', '비름나물', '비트', '뽕', '상추', 
    '시금치', '신선초', '쑥', '아욱', '양상추', '우엉', '참나물', '청경채', '취나물', '치커리', '케일', '파슬리', '호박',
    '고추냉이', '당근', '더덕', '도라지', '마늘', '비트', '생강', '순무', '양파', '연근', '우엉', '치커리',
    '고구마', '고사리', '달래', '두릅', '미나리', '부추', '셀러리', '아스파라거스', '죽순', '콜라비', '토란', '파', '풋마늘',
    '멜론', '박', '수박', '오이', '참외', '호박','가지', '고추', '토마토', '피망','감', '배', '사과', '석류',
    '대추', '매실', '복숭아', '오미자', '자두', '체리','감귤', '레몬', '오렌지', '유자', '자몽',
    '새송이버섯','표고버섯','느타리버섯','목이버섯','양송이버섯','송이버섯','목이버섯','귀리', '메밀', '밀', '보리', '수수', '쌀', ' 옥수수', '율무', '조', '퀴노아', '피', '호밀'
  ]
  }
} 




//초기 분류
// '육류':{
//   '고기' :[ '소고기', '돼지고기', '양고기', '닭고기','오리고기'] , 
//   '알' : ['달걀','메추리알' ]
// },
// '해산물':['고등어','꽁치','날치','갈치','연어','송어','새우','게','오징어','문어','낙지','쭈꾸미','멍게']
// ,
// '채소':{
//   '구황작물' : ['감자', '고구마', '곤약', '마', '마카', '토란'],
//   '콩':['강낭콩', '녹두', '대두', '완두', '팥'],
//   '견과류':['땅콩', '도토리', '마카다미아', '밤', '아몬드', '은행', '잣', '피스타치오', '호두'],  
//   '결구 엽채류 ' :['배추', '브로콜리', '양배추'],
//   ' 엽채류':['갓', '고추냉이', '냉이', '당귀', '돌나물', '머위', '무', '민들레', '비름나물', '비트', '뽕', '상추', '시금치', '신선초', '쑥', '아욱', '양상추', '우엉', '참나물', '청경채', '취나물', '치커리', '케일', '파슬리', '호박'],
//   '근채류':['고추냉이', '당근', '더덕', '도라지', '마늘', '비트', '생강', '순무', '양파', '연근', '우엉', '치커리'],
//   '엽경채류':['고구마', '고사리', '달래', '두릅', '미나리', '부추', '셀러리', '아스파라거스', '죽순', '콜라비', '토란', '파', '풋마늘'],
//   '박과':['멜론', '박', '수박', '오이', '참외', '호박'],
//   '박과이외 야채류' : ['가지', '고추', '토마토', '피망']
// },
// '과일':{
//  '인과' :['감', '배', '사과', '석류'],
//  '핵과' : ['대추', '매실', '복숭아', '오미자', '자두', '체리'],
//  '감귤' : ['감귤', '레몬', '오렌지', '유자', '자몽'],
// },
// '버섯':{
//  '버섯' : ['새송이버섯','표고버섯','느타리버섯','목이버섯','양송이버섯','송이버섯','목이버섯']
// },
// '곡류' : ['귀리', '메밀', '밀', '보리', '수수', '쌀', ' 옥수수', '율무', '조', '퀴노아', '피', '호밀']
// }